<?php

/**
 * Разные настройки и информация об игре.
 * @author Mic, 2010
 */
class Config_Game
{
	/**
	 * Список рас.
	 * @var array
	 */
	public static $races = array(
		1 => 'Человек',
		2 => 'Орк',
		3 => 'Дварф',
		4 => 'Ночной эльф',
		5 => 'Нежить',
		6 => 'Таурен',
		7 => 'Гном',
		8 => 'Тролль',
		10 => 'Кровавый эльф',
		11 => 'Дреней'
	);
	
	/**
	 * Список рас Альянса.
	 * @var array
	 */
	public static $alliance = array(1, 3, 4, 7, 11);
	
	/**
	 * Список классов.
	 * @var array
	 */
	public static $classes = array(
		1 => 'Воин',
		2 => 'Паладин',
		3 => 'Охотник',
		4 => 'Разбойник',
		5 => 'Жрец',
		6 => 'Рыцарь смерти',
		7 => 'Шаман',
		8 => 'Маг',
		9 => 'Колдун',
		11 => 'Друид'
	);
	
	/**
	 * Номера полей внутри поля characters.data.
	 * @var array
	 */
	public static $data = array(
		'gender' => 22,
		'health' => 23,
		'level' => 53,
		'money' => 1144,
		'kills' => 1200,
		'honor' => 1246,
		'arena' => 1247
	);
	
	/**
	 * Типы арен.
	 * @var array
	 */
	public static $arena = array(
		2 => '2x2',
		3 => '3x3',
		5 => '5x5'
	);
	
	/**
	 * Уровни пользователей.
	 * @var array
	 */
	public static $levels = array(
		0 => 'игрок',
		1 => 'модератор',
		2 => 'гейммастер',
		3 => 'администратор'
	);
	
	/**
	 * Категории предметов.
	 * @var array
	 */
	public static $categories = array(
		1 => 'Сумки',
		2 => 'Оружие',
		4 => 'Броня',
		7 => 'Товары',
		10 => 'Валюта',
		15 => 'Прочее',
	);
	
	/**
	 * Подкатегории предметов.
	 * @var array
	 */
	public static $subcategories = array(
		1 => array(
			0 => 'Обычные',
			1 => 'Сумки душ',
			2 => 'Сумки травника',
			3 => 'Сумки зачарователя',
			4 => 'Сумки инженера',
			5 => 'Сумки ювелира',
			6 => 'Сумки шахтера',
			7 => 'Сумки кожевника',
			8 => 'Сумки начертателя'
		),
		2 => array(
			0 => 'Одноручные топоры',
			1 => 'Двуручные топоры',
			2 => 'Луки',
			3 => 'Огнестрельное',
			4 => 'Одноручные дубинки',
			5 => 'Двуручные дубинки',
			6 => 'Древковое',
			7 => 'Одноручные мечи',
			8 => 'Двуручные мечи',
			10 => 'Посохи',
			13 => 'Кистевое',
			14 => 'Разное',
			15 => 'Кинжалы',
			16 => 'Метательное',
			18 => 'Арбалеты',
			19 => 'Жезлы',
			20 => 'Удочки'
		),
		4 => array(
			0 => 'Прочее',
			1 => 'Ткань',
			2 => 'Кожа',
			3 => 'Кольчуга',
			4 => 'Латы',
			6 => 'Щиты',
		),
		7 => array(
			11 => 'Прочие',
		),
		10 => array(
			0 => 'Валюта',
		),
		15 => array(
			0 => 'Токены',
			2 => 'Спутники',
			4 => 'Прочее',
			5 => 'Транспорт',
		),
	);
};
